zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_SSR Bits */
/* I2C_SSR[RREQ] Bits */
#define I2C_SSR_RREQ_OFS                         (0)                             /* !< RREQ Offset */
#define I2C_SSR_RREQ_MASK                        ((uint32_t)0x00000001U)         /* !< Receive Request */
#define I2C_SSR_RREQ_CLEARED                     ((uint32_t)0x00000000U)         /* !< No outstanding receive data. */
#define I2C_SSR_RREQ_SET                         ((uint32_t)0x00000001U)         /* !< The I2C controller has outstanding
                                                                                    receive data from the I2C Controller
                                                                                    and is using clock stretching to
                                                                                    delay the Controller until the data
                                                                                    has been read from the SRXDATA FIFO
                                                                                    (Target RX FIFO is full). */
/* I2C_SSR[TREQ] Bits */
#define I2C_SSR_TREQ_OFS                         (1)                             /* !< TREQ Offset */
#define I2C_SSR_TREQ_MASK                        ((uint32_t)0x00000002U)         /* !< Transmit Request */
#define I2C_SSR_TREQ_CLEARED                     ((uint32_t)0x00000000U)         /* !< No outstanding transmit request. */
#define I2C_SSR_TREQ_SET                         ((uint32_t)0x00000002U)         /* !< The I2C controller has been
                                                                                    addressed as a Target transmitter and
                                                                                    is using clock stretching to delay
                                                                                    the Controller until data has been
                                                                                    written to the STXDATA FIFO (Target
                                                                                    TX FIFO is empty). */
/* I2C_SSR[OAR2SEL] Bits */
#define I2C_SSR_OAR2SEL_OFS                      (3)                             /* !< OAR2SEL Offset */
#define I2C_SSR_OAR2SEL_MASK                     ((uint32_t)0x00000008U)         /* !< OAR2 Address Matched This bit gets
                                                                                    reevaluated after every address
                                                                                    comparison. */
#define I2C_SSR_OAR2SEL_CLEARED                  ((uint32_t)0x00000000U)         /* !< Either the OAR2 address is not
                                                                                    matched or the match is in legacy
                                                                                    mode. */
#define I2C_SSR_OAR2SEL_SET                      ((uint32_t)0x00000008U)         /* !< OAR2 address matched and ACKed by
                                                                                    the Target. */
/* I2C_SSR[QCMDST] Bits */
#define I2C_SSR_QCMDST_OFS                       (4)                             /* !< QCMDST Offset */
#define I2C_SSR_QCMDST_MASK                      ((uint32_t)0x00000010U)         /* !< Quick Command Status Value
                                                                                    Description: 0: The last transaction
                                                                                    was a normal transaction or a
                                                                                    transaction has not occurred. 1: The
                                                                                    last transaction was a Quick Command
                                                                                    transaction */
#define I2C_SSR_QCMDST_CLEARED                   ((uint32_t)0x00000000U)         /* !< The last transaction was a normal
                                                                                    transaction or a transaction has not
                                                                                    occurred. */
#define I2C_SSR_QCMDST_SET                       ((uint32_t)0x00000010U)         /* !< The last transaction was a Quick
                                                                                    Command transaction. */
/* I2C_SSR[QCMDRW] Bits */
#define I2C_SSR_QCMDRW_OFS                       (5)                             /* !< QCMDRW Offset */
#define I2C_SSR_QCMDRW_MASK                      ((uint32_t)0x00000020U)         /* !< Quick Command Read / Write  This
                                                                                    bit only has meaning when the QCMDST
                                                                                    bit is set.  Value Description: 0:
                                                                                    Quick command was a write 1: Quick
                                                                                    command was a read */
#define I2C_SSR_QCMDRW_CLEARED                   ((uint32_t)0x00000000U)         /* !< Quick command was a write */
#define I2C_SSR_QCMDRW_SET                       ((uint32_t)0x00000020U)         /* !< Quick command was a read */
/* I2C_SSR[RXMODE] Bits */
#define I2C_SSR_RXMODE_OFS                       (2)                             /* !< RXMODE Offset */
#define I2C_SSR_RXMODE_MASK                      ((uint32_t)0x00000004U)         /* !< Target FSM is in Rx MODE */
#define I2C_SSR_RXMODE_CLEARED                   ((uint32_t)0x00000000U)         /* !< The Target State Machine is not in
                                                                                    the RX_DATA, RX_ACK, RX_WAIT,
                                                                                    RX_ACK_WAIT or ADDR_ACK state with
                                                                                    the bus direction set to write. */
#define I2C_SSR_RXMODE_SET                       ((uint32_t)0x00000004U)         /* !< The Target State Machine is in the
                                                                                    RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT
                                                                                    or ADDR_ACK state with the bus
                                                                                    direction set to write. */
/* I2C_SSR[BUSBSY] Bits */
#define I2C_SSR_BUSBSY_OFS                       (6)                             /* !< BUSBSY Offset */
#define I2C_SSR_BUSBSY_MASK                      ((uint32_t)0x00000040U)         /* !< I2C bus is busy */
#define I2C_SSR_BUSBSY_CLEARED                   ((uint32_t)0x00000000U)         /* !< The I2C Bus is not busy */
#define I2C_SSR_BUSBSY_SET                       ((uint32_t)0x00000040U)         /* !< The I2C Bus is busy. This is
                                                                                    cleared on a timeout. */
/* I2C_SSR[TXMODE] Bits */
#define I2C_SSR_TXMODE_OFS                       (7)                             /* !< TXMODE Offset */
#define I2C_SSR_TXMODE_MASK                      ((uint32_t)0x00000080U)         /* !< Target FSM is in TX MODE */
#define I2C_SSR_TXMODE_CLEARED                   ((uint32_t)0x00000000U)         /* !< The Target State Machine is not in
                                                                                    TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK
                                                                                    state with the bus direction set to
                                                                                    read. */
#define I2C_SSR_TXMODE_SET                       ((uint32_t)0x00000080U)         /* !< The Target State Machine is in
                                                                                    TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK
                                                                                    state with the bus direction set to
                                                                                    read. */
/* I2C_SSR[STALE_TXFIFO] Bits */
#define I2C_SSR_STALE_TXFIFO_OFS                 (8)                             /* !< STALE_TXFIFO Offset */
#define I2C_SSR_STALE_TXFIFO_MASK                ((uint32_t)0x00000100U)         /* !< Stale Tx FIFO */
#define I2C_SSR_STALE_TXFIFO_CLEARED             ((uint32_t)0x00000000U)         /* !< Tx FIFO is not stale */
#define I2C_SSR_STALE_TXFIFO_SET                 ((uint32_t)0x00000100U)         /* !< The TX FIFO is stale. This occurs
                                                                                    when the TX FIFO was not emptied
                                                                                    during the previous I2C transaction. */
/* I2C_SSR[ADDRMATCH] Bits */
#define I2C_SSR_ADDRMATCH_OFS                    (9)                             /* !< ADDRMATCH Offset */
#define I2C_SSR_ADDRMATCH_MASK                   ((uint32_t)0x0007FE00U)         /* !< Indicates the address for which
                                                                                    Target address match happened */
#define I2C_SSR_ADDRMATCH_MINIMUM                ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define I2C_SSR_ADDRMATCH_MAXIMUM                ((uint32_t)0x0007FE00U)         /* !< Maximum Value */

/* I2C_SRXDATA Bits */
/* I2C_SRXDATA[VALUE] Bits */
#define I2C_SRXDATA_VALUE_OFS                    (0)                             /* !< VALUE Offset */
#define I2C_SRXDATA_VALUE_MASK                   ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define I2C_SRXDATA_VALUE_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_SRXDATA_VALUE_MAXIMUM                ((uint32_t)0x000000FFU)         /* !< Highest possible value */

