zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_STXDATA Bits */
/* I2C_STXDATA[VALUE] Bits */
#define I2C_STXDATA_VALUE_OFS                    (0)                             /* !< VALUE Offset */
#define I2C_STXDATA_VALUE_MASK                   ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define I2C_STXDATA_VALUE_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_STXDATA_VALUE_MAXIMUM                ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* I2C_SACKCTL Bits */
/* I2C_SACKCTL[ACKOEN] Bits */
#define I2C_SACKCTL_ACKOEN_OFS                   (0)                             /* !< ACKOEN Offset */
#define I2C_SACKCTL_ACKOEN_MASK                  ((uint32_t)0x00000001U)         /* !< I2C Target ACK Override Enable */
#define I2C_SACKCTL_ACKOEN_DISABLE               ((uint32_t)0x00000000U)         /* !< A response in not provided. */
#define I2C_SACKCTL_ACKOEN_ENABLE                ((uint32_t)0x00000001U)         /* !< An ACK or NACK is sent according to
                                                                                    the value written to the ACKOVAL bit. */
/* I2C_SACKCTL[ACKOVAL] Bits */
#define I2C_SACKCTL_ACKOVAL_OFS                  (1)                             /* !< ACKOVAL Offset */
#define I2C_SACKCTL_ACKOVAL_MASK                 ((uint32_t)0x00000002U)         /* !< I2C Target ACK Override Value Note:
                                                                                    for General Call this bit will be
                                                                                    ignored if set to NACK and Target
                                                                                    continues to receive data. */
#define I2C_SACKCTL_ACKOVAL_DISABLE              ((uint32_t)0x00000000U)         /* !< An ACK is sent indicating valid
                                                                                    data or command. */
#define I2C_SACKCTL_ACKOVAL_ENABLE               ((uint32_t)0x00000002U)         /* !< A NACK is sent indicating invalid
                                                                                    data or command. */
/* I2C_SACKCTL[ACKOEN_ON_START] Bits */
#define I2C_SACKCTL_ACKOEN_ON_START_OFS          (2)                             /* !< ACKOEN_ON_START Offset */
#define I2C_SACKCTL_ACKOEN_ON_START_MASK         ((uint32_t)0x00000004U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following a Start
                                                                                    Condition. */
#define I2C_SACKCTL_ACKOEN_ON_START_DISABLE      ((uint32_t)0x00000000U)         /* !< No special behavior */
#define I2C_SACKCTL_ACKOEN_ON_START_ENABLE       ((uint32_t)0x00000004U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following a Start
                                                                                    Condition. */
/* I2C_SACKCTL[ACKOEN_ON_PECNEXT] Bits */
#define I2C_SACKCTL_ACKOEN_ON_PECNEXT_OFS        (3)                             /* !< ACKOEN_ON_PECNEXT Offset */
#define I2C_SACKCTL_ACKOEN_ON_PECNEXT_MASK       ((uint32_t)0x00000008U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following the ACK/NACK
                                                                                    of the byte received just prior to
                                                                                    the PEC byte. Note that when ACKOEN
                                                                                    is set the PEC byte will not
                                                                                    automatically be ACKed/NACKed by the
                                                                                    State Machine and FW must perform
                                                                                    this function by writing
                                                                                    Target_SACKCTL. */
#define I2C_SACKCTL_ACKOEN_ON_PECNEXT_DISABLE    ((uint32_t)0x00000000U)         /* !< No special behavior */
#define I2C_SACKCTL_ACKOEN_ON_PECNEXT_ENABLE     ((uint32_t)0x00000008U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following the ACK/NACK
                                                                                    of the byte received just prior to
                                                                                    the PEC byte. Note that when ACKOEN
                                                                                    is set the PEC byte will not
                                                                                    automatically be ACKed/NACKed by the
                                                                                    State Machine and FW must perform
                                                                                    this function by writing
                                                                                    Target_SACKCTL. */
/* I2C_SACKCTL[ACKOEN_ON_PECDONE] Bits */
#define I2C_SACKCTL_ACKOEN_ON_PECDONE_OFS        (4)                             /* !< ACKOEN_ON_PECDONE Offset */
#define I2C_SACKCTL_ACKOEN_ON_PECDONE_MASK       ((uint32_t)0x00000010U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following the ACK/NACK
                                                                                    of the received PEC byte. */
#define I2C_SACKCTL_ACKOEN_ON_PECDONE_DISABLE    ((uint32_t)0x00000000U)         /* !< No special behavior */
#define I2C_SACKCTL_ACKOEN_ON_PECDONE_ENABLE     ((uint32_t)0x00000010U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following the ACK/NACK
                                                                                    of the received PEC byte. */

