zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_MCTR Bits */
/* I2C_MCTR[BURSTRUN] Bits */
#define I2C_MCTR_BURSTRUN_OFS                    (0)                             /* !< BURSTRUN Offset */
#define I2C_MCTR_BURSTRUN_MASK                   ((uint32_t)0x00000001U)         /* !< I2C Controller Enable and start
                                                                                    transaction */
#define I2C_MCTR_BURSTRUN_DISABLE                ((uint32_t)0x00000000U)         /* !< In standard mode, this encoding
                                                                                    means the Controller is unable to
                                                                                    transmit or receive data. */
#define I2C_MCTR_BURSTRUN_ENABLE                 ((uint32_t)0x00000001U)         /* !< The Controller is able to transmit
                                                                                    or receive data. See field decoding
                                                                                    in Table: MCTR Field decoding. */
/* I2C_MCTR[START] Bits */
#define I2C_MCTR_START_OFS                       (1)                             /* !< START Offset */
#define I2C_MCTR_START_MASK                      ((uint32_t)0x00000002U)         /* !< Generate START */
#define I2C_MCTR_START_DISABLE                   ((uint32_t)0x00000000U)         /* !< The controller does not generate
                                                                                    the START condition. */
#define I2C_MCTR_START_ENABLE                    ((uint32_t)0x00000002U)         /* !< The controller generates the START
                                                                                    or repeated START condition. See
                                                                                    field decoding in Table: MCTR Field
                                                                                    decoding. */
/* I2C_MCTR[STOP] Bits */
#define I2C_MCTR_STOP_OFS                        (2)                             /* !< STOP Offset */
#define I2C_MCTR_STOP_MASK                       ((uint32_t)0x00000004U)         /* !< Generate STOP */
#define I2C_MCTR_STOP_DISABLE                    ((uint32_t)0x00000000U)         /* !< The controller does not generate
                                                                                    the STOP condition. */
#define I2C_MCTR_STOP_ENABLE                     ((uint32_t)0x00000004U)         /* !< The controller generates the STOP
                                                                                    condition. See field decoding in
                                                                                    Table: MCTR Field decoding. */
/* I2C_MCTR[ACK] Bits */
#define I2C_MCTR_ACK_OFS                         (3)                             /* !< ACK Offset */
#define I2C_MCTR_ACK_MASK                        ((uint32_t)0x00000008U)         /* !< Data Acknowledge Enable. Software
                                                                                    needs to configure this bit to send
                                                                                    the ACK or NACK. See field decoding
                                                                                    in Table: MCTR Field decoding. */
#define I2C_MCTR_ACK_DISABLE                     ((uint32_t)0x00000000U)         /* !< The last received data byte of a
                                                                                    transaction is not acknowledged
                                                                                    automatically by the Controller. */
#define I2C_MCTR_ACK_ENABLE                      ((uint32_t)0x00000008U)         /* !< The last received data byte of a
                                                                                    transaction is acknowledged
                                                                                    automatically by the Controller. */
/* I2C_MCTR[MBLEN] Bits */
#define I2C_MCTR_MBLEN_OFS                       (16)                            /* !< MBLEN Offset */
#define I2C_MCTR_MBLEN_MASK                      ((uint32_t)0x0FFF0000U)         /* !< I2C transaction length This field
                                                                                    contains the programmed length of
                                                                                    bytes of the Transaction. */
#define I2C_MCTR_MBLEN_MINIMUM                   ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_MCTR_MBLEN_MAXIMUM                   ((uint32_t)0x0FFF0000U)         /* !< Highest possible value */
/* I2C_MCTR[MACKOEN] Bits */
#define I2C_MCTR_MACKOEN_OFS                     (4)                             /* !< MACKOEN Offset */
#define I2C_MCTR_MACKOEN_MASK                    ((uint32_t)0x00000010U)         /* !< Controller ACK overrride Enable */
#define I2C_MCTR_MACKOEN_DISABLE                 ((uint32_t)0x00000000U)         /* !< No special behavior */
#define I2C_MCTR_MACKOEN_ENABLE                  ((uint32_t)0x00000010U)         /* !< When 1 and the Controller is
                                                                                    receiving data and the number of
                                                                                    bytes indicated in MBLEN have been
                                                                                    received, the state machine will
                                                                                    generate an rxdone interrupt and wait
                                                                                    at the start of the ACK for FW to
                                                                                    indicate if an ACK or NACK should be
                                                                                    sent. The ACK or NACK is selected by
                                                                                    writing the MCTR register and setting
                                                                                    ACK accordingly. The other fields in
                                                                                    this register can also be written at
                                                                                    this time to continue on with the
                                                                                    transaction. If a NACK is sent the
                                                                                    state machine will automatically send
                                                                                    a Stop. */
/* I2C_MCTR[RD_ON_TXEMPTY] Bits */
#define I2C_MCTR_RD_ON_TXEMPTY_OFS               (5)                             /* !< RD_ON_TXEMPTY Offset */
#define I2C_MCTR_RD_ON_TXEMPTY_MASK              ((uint32_t)0x00000020U)         /* !< Read on TX Empty */
#define I2C_MCTR_RD_ON_TXEMPTY_DISABLE           ((uint32_t)0x00000000U)         /* !< No special behavior */
#define I2C_MCTR_RD_ON_TXEMPTY_ENABLE            ((uint32_t)0x00000020U)         /* !< When 1 the Controller will transmit
                                                                                    all bytes from the TX FIFO before
                                                                                    continuing with the programmed Burst
                                                                                    Run Read. If the DIR is not set to
                                                                                    Read in the MSA then this bit is
                                                                                    ignored. The Start must be set in the
                                                                                    MCTR for proper I2C protocol. The
                                                                                    Controller will first send the Start
                                                                                    Condition, I2C Address with R/W bit
                                                                                    set to write, before sending the
                                                                                    bytes in the TX FIFO. When the TX
                                                                                    FIFO is empty, the I2C transaction
                                                                                    will continue as programmed in MTCR
                                                                                    and MSA without sending a Stop
                                                                                    Condition. This is intended to be
                                                                                    used to perform simple I2C command
                                                                                    based reads transition that will
                                                                                    complete after initiating them
                                                                                    without having to get an interrupt to
                                                                                    turn the bus around. */

/* I2C_MSR Bits */
/* I2C_MSR[BUSY] Bits */
#define I2C_MSR_BUSY_OFS                         (0)                             /* !< BUSY Offset */
#define I2C_MSR_BUSY_MASK                        ((uint32_t)0x00000001U)         /* !< I2C Controller FSM Busy The BUSY
                                                                                    bit is set during an ongoing
                                                                                    transaction, so is set during the
                                                                                    transmit/receive of the amount of
                                                                                    data set in MBLEN including START,
                                                                                    RESTART, Address and STOP signal
                                                                                    generation when required for the
                                                                                    current transaction. */
#define I2C_MSR_BUSY_CLEARED                     ((uint32_t)0x00000000U)         /* !< The controller is idle. */
#define I2C_MSR_BUSY_SET                         ((uint32_t)0x00000001U)         /* !< The controller is busy. */
/* I2C_MSR[ERR] Bits */
#define I2C_MSR_ERR_OFS                          (1)                             /* !< ERR Offset */
#define I2C_MSR_ERR_MASK                         ((uint32_t)0x00000002U)         /* !< Error  The error can be from the
                                                                                    Target address not being acknowledged
                                                                                    or the transmit data not being
                                                                                    acknowledged. */
#define I2C_MSR_ERR_CLEARED                      ((uint32_t)0x00000000U)         /* !< No error was detected on the last
                                                                                    operation. */
#define I2C_MSR_ERR_SET                          ((uint32_t)0x00000002U)         /* !< An error occurred on the last
                                                                                    operation. */
/* I2C_MSR[ADRACK] Bits */
#define I2C_MSR_ADRACK_OFS                       (2)                             /* !< ADRACK Offset */
#define I2C_MSR_ADRACK_MASK                      ((uint32_t)0x00000004U)         /* !< Acknowledge Address */
#define I2C_MSR_ADRACK_CLEARED                   ((uint32_t)0x00000000U)         /* !< The transmitted address was
                                                                                    acknowledged */
#define I2C_MSR_ADRACK_SET                       ((uint32_t)0x00000004U)         /* !< The transmitted address was not
                                                                                    acknowledged. */
/* I2C_MSR[DATACK] Bits */
#define I2C_MSR_DATACK_OFS                       (3)                             /* !< DATACK Offset */
#define I2C_MSR_DATACK_MASK                      ((uint32_t)0x00000008U)         /* !< Acknowledge Data */
#define I2C_MSR_DATACK_CLEARED                   ((uint32_t)0x00000000U)         /* !< The transmitted data was
                                                                                    acknowledged */
#define I2C_MSR_DATACK_SET                       ((uint32_t)0x00000008U)         /* !< The transmitted data was not
                                                                                    acknowledged. */
/* I2C_MSR[ARBLST] Bits */
#define I2C_MSR_ARBLST_OFS                       (4)                             /* !< ARBLST Offset */
#define I2C_MSR_ARBLST_MASK                      ((uint32_t)0x00000010U)         /* !< Arbitration Lost */
#define I2C_MSR_ARBLST_CLEARED                   ((uint32_t)0x00000000U)         /* !< The I2C controller won arbitration. */
#define I2C_MSR_ARBLST_SET                       ((uint32_t)0x00000010U)         /* !< The I2C controller lost
                                                                                    arbitration. */
/* I2C_MSR[IDLE] Bits */
#define I2C_MSR_IDLE_OFS                         (5)                             /* !< IDLE Offset */
#define I2C_MSR_IDLE_MASK                        ((uint32_t)0x00000020U)         /* !< I2C Idle */
#define I2C_MSR_IDLE_CLEARED                     ((uint32_t)0x00000000U)         /* !< The I2C controller is not idle. */
#define I2C_MSR_IDLE_SET                         ((uint32_t)0x00000020U)         /* !< The I2C controller is idle. */
/* I2C_MSR[BUSBSY] Bits */
#define I2C_MSR_BUSBSY_OFS                       (6)                             /* !< BUSBSY Offset */
#define I2C_MSR_BUSBSY_MASK                      ((uint32_t)0x00000040U)         /* !< I2C Bus is Busy Controller State
                                                                                    Machine will wait until this bit is
                                                                                    cleared before starting a
                                                                                    transaction. When first enabling the
                                                                                    Controller in multi Controller
                                                                                    environments, FW should wait for one
                                                                                    I2C clock period after setting ACTIVE
                                                                                    high before writing to the MTCR
                                                                                    register to start the transaction so
                                                                                    that if SCL goes low it will trigger
                                                                                    the BUSBSY. */
#define I2C_MSR_BUSBSY_CLEARED                   ((uint32_t)0x00000000U)         /* !< The I2C bus is idle. */
#define I2C_MSR_BUSBSY_SET                       ((uint32_t)0x00000040U)         /* !< 'This Status bit is set on a START
                                                                                    or when SCL goes low. It is cleared
                                                                                    on a STOP,  or when a SCL high bus
                                                                                    busy timeout occurs and SCL and SDA
                                                                                    are both high. This status is cleared
                                                                                    when the ACTIVE bit is low.   Note
                                                                                    that the Controller State Machine
                                                                                    will wait until this bit is cleared
                                                                                    before starting an I2C transaction.
                                                                                    When first enabling the Controller in
                                                                                    multi Controller environments, FW
                                                                                    should wait for one I2C clock period
                                                                                    after setting ACTIVE high before
                                                                                    writing to the MTCR register to start
                                                                                    the transaction so that if SCL goes
                                                                                    low it will trigger the BUSBSY. */
/* I2C_MSR[MBCNT] Bits */
#define I2C_MSR_MBCNT_OFS                        (16)                            /* !< MBCNT Offset */
#define I2C_MSR_MBCNT_MASK                       ((uint32_t)0x0FFF0000U)         /* !< I2C Controller Transaction Count
                                                                                    This field contains the current
                                                                                    count-down value of the transaction. */
#define I2C_MSR_MBCNT_MINIMUM                    ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_MSR_MBCNT_MAXIMUM                    ((uint32_t)0x0FFF0000U)         /* !< Highest possible value */

