zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_MFIFOSR Bits */
/* I2C_MFIFOSR[RXFIFOCNT] Bits */
#define I2C_MFIFOSR_RXFIFOCNT_OFS                (0)                             /* !< RXFIFOCNT Offset */
#define I2C_MFIFOSR_RXFIFOCNT_MASK               ((uint32_t)0x0000000FU)         /* !< Number of Bytes which could be read
                                                                                    from the RX FIFO */
#define I2C_MFIFOSR_RXFIFOCNT_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_MFIFOSR_RXFIFOCNT_MAXIMUM            ((uint32_t)0x00000008U)         /* !< Highest possible value */
/* I2C_MFIFOSR[TXFIFOCNT] Bits */
#define I2C_MFIFOSR_TXFIFOCNT_OFS                (8)                             /* !< TXFIFOCNT Offset */
#define I2C_MFIFOSR_TXFIFOCNT_MASK               ((uint32_t)0x00000F00U)         /* !< Number of Bytes which could be put
                                                                                    into the TX FIFO */
#define I2C_MFIFOSR_TXFIFOCNT_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_MFIFOSR_TXFIFOCNT_MAXIMUM            ((uint32_t)0x00000800U)         /* !< Highest possible value */
/* I2C_MFIFOSR[RXFLUSH] Bits */
#define I2C_MFIFOSR_RXFLUSH_OFS                  (7)                             /* !< RXFLUSH Offset */
#define I2C_MFIFOSR_RXFLUSH_MASK                 ((uint32_t)0x00000080U)         /* !< RX FIFO Flush When this bit is set
                                                                                    a Flush operation for the RX FIFO is
                                                                                    active. Clear the RXFLUSH bit in the
                                                                                    control register to stop. */
#define I2C_MFIFOSR_RXFLUSH_INACTIVE             ((uint32_t)0x00000000U)         /* !< FIFO Flush not active */
#define I2C_MFIFOSR_RXFLUSH_ACTIVE               ((uint32_t)0x00000080U)         /* !< FIFO Flush active */
/* I2C_MFIFOSR[TXFLUSH] Bits */
#define I2C_MFIFOSR_TXFLUSH_OFS                  (15)                            /* !< TXFLUSH Offset */
#define I2C_MFIFOSR_TXFLUSH_MASK                 ((uint32_t)0x00008000U)         /* !< TX FIFO Flush When this bit is set
                                                                                    a Flush operation for the TX FIFO is
                                                                                    active. Clear the TXFLUSH bit in the
                                                                                    control register to stop. */
#define I2C_MFIFOSR_TXFLUSH_INACTIVE             ((uint32_t)0x00000000U)         /* !< FIFO Flush not active */
#define I2C_MFIFOSR_TXFLUSH_ACTIVE               ((uint32_t)0x00008000U)         /* !< FIFO Flush active */

/* I2C_CONTROLLER_I2CPECCTL Bits */
/* I2C_CONTROLLER_I2CPECCTL[PECCNT] Bits */
#define I2C_CONTROLLER_I2CPECCTL_PECCNT_OFS      (0)                             /* !< PECCNT Offset */
#define I2C_CONTROLLER_I2CPECCTL_PECCNT_MASK     ((uint32_t)0x000001FFU)         /* !< PEC Count When this field is non
                                                                                    zero, the number of I2C bytes are
                                                                                    counted (Note that although the PEC
                                                                                    is calculated on the I2C address it
                                                                                    is not counted at a byte). When the
                                                                                    byte count = PECCNT and the state
                                                                                    machine is transmitting, the contents
                                                                                    of the LSFR is loaded into the shift
                                                                                    register instead of the byte received
                                                                                    from the Tx FIFO. When the state
                                                                                    machine is receiving, after the last
                                                                                    bit of this byte is received the LSFR
                                                                                    is checked and if it is non-zero, a
                                                                                    PEC RX Error interrupt is generated.
                                                                                    The I2C packet must be padded to
                                                                                    include the PEC byte for both
                                                                                    transmit and receive. In transmit
                                                                                    mode the FIFO must be loaded with a
                                                                                    dummy PEC byte. In receive mode the
                                                                                    PEC byte will be passed to the Rx
                                                                                    FIFO.  In the normal Controller use
                                                                                    case, FW would set PECEN=1 and
                                                                                    PECCNT=SMB packet length (Not
                                                                                    including Target Address byte, but
                                                                                    including the PEC byte). FW would
                                                                                    then configure DMA to allow the
                                                                                    packet to complete unassisted and
                                                                                    write MCTR to initiate the
                                                                                    transaction.  Note that when the byte
                                                                                    count = PEC CNT, the byte count is
                                                                                    reset to 0 and multiple PEC
                                                                                    calculation can automatically occur
                                                                                    within a single I2C transaction.
                                                                                    Note that any write to the
                                                                                    Controller_I2CPECCTL Register will
                                                                                    clear the current PEC Byte Count in
                                                                                    the Controller State Machine. */
#define I2C_CONTROLLER_I2CPECCTL_PECCNT_MINIMUM  ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define I2C_CONTROLLER_I2CPECCTL_PECCNT_MAXIMUM  ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* I2C_CONTROLLER_I2CPECCTL[PECEN] Bits */
#define I2C_CONTROLLER_I2CPECCTL_PECEN_OFS       (12)                            /* !< PECEN Offset */
#define I2C_CONTROLLER_I2CPECCTL_PECEN_MASK      ((uint32_t)0x00001000U)         /* !< PEC Enable This bit enables the SMB
                                                                                    Packet Error Checking (PEC). When
                                                                                    enabled the PEC is calculated on all
                                                                                    bits except the Start, Stop, Ack and
                                                                                    Nack. The PEC LSFR and the Byte
                                                                                    Counter is set to 0 when the State
                                                                                    Machine is in the IDLE state, which
                                                                                    occur following a Stop or when a
                                                                                    timeout occurs. The Counter is also
                                                                                    set to 0 after the PEC byte is sent
                                                                                    or received. Note that the NACK is
                                                                                    automatically send following a PEC
                                                                                    byte that results in a PEC error. The
                                                                                    PEC Polynomial is x^8 + x^2 + x^1 +
                                                                                    1. */
#define I2C_CONTROLLER_I2CPECCTL_PECEN_DISABLE   ((uint32_t)0x00000000U)         /* !< PEC is disabled in Controller mode */
#define I2C_CONTROLLER_I2CPECCTL_PECEN_ENABLE    ((uint32_t)0x00001000U)         /* !< PEC is enabled in Controller mode */

/* I2C_CONTROLLER_PECSR Bits */
/* I2C_CONTROLLER_PECSR[PECBYTECNT] Bits */
#define I2C_CONTROLLER_PECSR_PECBYTECNT_OFS      (0)                             /* !< PECBYTECNT Offset */
#define I2C_CONTROLLER_PECSR_PECBYTECNT_MASK     ((uint32_t)0x000001FFU)         /* !< PEC Byte Count	 This is the current
                                                                                    PEC Byte Count of the Controller
                                                                                    State Machine. */
#define I2C_CONTROLLER_PECSR_PECBYTECNT_MINIMUM  ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define I2C_CONTROLLER_PECSR_PECBYTECNT_MAXIMUM  ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* I2C_CONTROLLER_PECSR[PECSTS_CHECK] Bits */
#define I2C_CONTROLLER_PECSR_PECSTS_CHECK_OFS    (16)                            /* !< PECSTS_CHECK Offset */
#define I2C_CONTROLLER_PECSR_PECSTS_CHECK_MASK   ((uint32_t)0x00010000U)         /* !< This status bit indicates if the
                                                                                    PEC was checked in the transaction
                                                                                    that occurred before the last Stop.
                                                                                    Latched on Stop. */
#define I2C_CONTROLLER_PECSR_PECSTS_CHECK_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC was not checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
#define I2C_CONTROLLER_PECSR_PECSTS_CHECK_SET    ((uint32_t)0x00010000U)         /* !< Indicates if the PEC was checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
/* I2C_CONTROLLER_PECSR[PECSTS_ERROR] Bits */
#define I2C_CONTROLLER_PECSR_PECSTS_ERROR_OFS    (17)                            /* !< PECSTS_ERROR Offset */
#define I2C_CONTROLLER_PECSR_PECSTS_ERROR_MASK   ((uint32_t)0x00020000U)         /* !< This status bit indicates if a PEC
                                                                                    check error occurred in the
                                                                                    transaction that occurred before the
                                                                                    last Stop. Latched on Stop. */
#define I2C_CONTROLLER_PECSR_PECSTS_ERROR_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC check error did not
                                                                                    occurr in the transaction that
                                                                                    occurred before the last Stop */
#define I2C_CONTROLLER_PECSR_PECSTS_ERROR_SET    ((uint32_t)0x00020000U)         /* !< Indicates if a PEC check error
                                                                                    occurred in the transaction that
                                                                                    occurred before the last Stop */

/* I2C_DMA_TRIG0_IIDX Bits */
/* I2C_DMA_TRIG0_IIDX[STAT] Bits */
#define I2C_DMA_TRIG0_IIDX_STAT_OFS              (0)                             /* !< STAT Offset */
#define I2C_DMA_TRIG0_IIDX_STAT_MASK             ((uint32_t)0x000000FFU)         /* !< I2C Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. 15h-1Fh =
                                                                                    Reserved */
#define I2C_DMA_TRIG0_IIDX_STAT_NO_INTR          ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define I2C_DMA_TRIG0_IIDX_STAT_MRXFIFOTRG       ((uint32_t)0x00000001U)         /* !< Controller receive FIFO Trigger
                                                                                    Level */
#define I2C_DMA_TRIG0_IIDX_STAT_MTXFIFOTRG       ((uint32_t)0x00000002U)         /* !< Controller transmit FIFO Trigger
                                                                                    level */
#define I2C_DMA_TRIG0_IIDX_STAT_SRXFIFOTRG       ((uint32_t)0x00000003U)         /* !< Target receive FIFO Trigger Level */
#define I2C_DMA_TRIG0_IIDX_STAT_STXFIFOTRG       ((uint32_t)0x00000004U)         /* !< Target transmit FIFO Trigger level */

/* I2C_DMA_TRIG0_IMASK Bits */
/* I2C_DMA_TRIG0_IMASK[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_IMASK_MRXFIFOTRG_OFS       (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_IMASK_MRXFIFOTRG_MASK      ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG0_IMASK_MRXFIFOTRG_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_IMASK_MRXFIFOTRG_SET       ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_IMASK[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_IMASK_MTXFIFOTRG_OFS       (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG0_IMASK_MTXFIFOTRG_MASK      ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG0_IMASK_MTXFIFOTRG_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_IMASK_MTXFIFOTRG_SET       ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_IMASK[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_IMASK_SRXFIFOTRG_OFS       (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_IMASK_SRXFIFOTRG_MASK      ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG0_IMASK_SRXFIFOTRG_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_IMASK_SRXFIFOTRG_SET       ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_IMASK[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_IMASK_STXFIFOTRG_OFS       (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG0_IMASK_STXFIFOTRG_MASK      ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG0_IMASK_STXFIFOTRG_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_IMASK_STXFIFOTRG_SET       ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* I2C_DMA_TRIG0_RIS Bits */
/* I2C_DMA_TRIG0_RIS[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_RIS_MRXFIFOTRG_OFS         (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_RIS_MRXFIFOTRG_MASK        ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG0_RIS_MRXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_RIS_MRXFIFOTRG_SET         ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_RIS[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_RIS_MTXFIFOTRG_OFS         (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG0_RIS_MTXFIFOTRG_MASK        ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG0_RIS_MTXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_RIS_MTXFIFOTRG_SET         ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_RIS[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_RIS_SRXFIFOTRG_OFS         (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_RIS_SRXFIFOTRG_MASK        ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG0_RIS_SRXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_RIS_SRXFIFOTRG_SET         ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_RIS[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_RIS_STXFIFOTRG_OFS         (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG0_RIS_STXFIFOTRG_MASK        ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG0_RIS_STXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_RIS_STXFIFOTRG_SET         ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* I2C_DMA_TRIG0_MIS Bits */
/* I2C_DMA_TRIG0_MIS[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_MIS_MRXFIFOTRG_OFS         (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_MIS_MRXFIFOTRG_MASK        ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG0_MIS_MRXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_MIS_MRXFIFOTRG_SET         ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_MIS[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_MIS_MTXFIFOTRG_OFS         (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG0_MIS_MTXFIFOTRG_MASK        ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG0_MIS_MTXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_MIS_MTXFIFOTRG_SET         ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_MIS[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_MIS_SRXFIFOTRG_OFS         (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_MIS_SRXFIFOTRG_MASK        ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG0_MIS_SRXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_MIS_SRXFIFOTRG_SET         ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_MIS[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_MIS_STXFIFOTRG_OFS         (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG0_MIS_STXFIFOTRG_MASK        ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG0_MIS_STXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_MIS_STXFIFOTRG_SET         ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

