zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_DMA_TRIG0_ISET Bits */
/* I2C_DMA_TRIG0_ISET[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_ISET_MRXFIFOTRG_OFS        (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_ISET_MRXFIFOTRG_MASK       ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG0_ISET_MRXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_ISET_MRXFIFOTRG_SET        ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_ISET[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_ISET_MTXFIFOTRG_OFS        (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG0_ISET_MTXFIFOTRG_MASK       ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG0_ISET_MTXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_ISET_MTXFIFOTRG_SET        ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_ISET[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_ISET_SRXFIFOTRG_OFS        (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_ISET_SRXFIFOTRG_MASK       ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG0_ISET_SRXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_ISET_SRXFIFOTRG_SET        ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_ISET[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_ISET_STXFIFOTRG_OFS        (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG0_ISET_STXFIFOTRG_MASK       ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG0_ISET_STXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_ISET_STXFIFOTRG_SET        ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* I2C_DMA_TRIG0_ICLR Bits */
/* I2C_DMA_TRIG0_ICLR[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_ICLR_MRXFIFOTRG_OFS        (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_ICLR_MRXFIFOTRG_MASK       ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG0_ICLR_MRXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_ICLR_MRXFIFOTRG_CLR        ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_ICLR[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_ICLR_MTXFIFOTRG_OFS        (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG0_ICLR_MTXFIFOTRG_MASK       ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG0_ICLR_MTXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_ICLR_MTXFIFOTRG_CLR        ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_ICLR[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_ICLR_SRXFIFOTRG_OFS        (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG0_ICLR_SRXFIFOTRG_MASK       ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG0_ICLR_SRXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_ICLR_SRXFIFOTRG_CLR        ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG0_ICLR[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG0_ICLR_STXFIFOTRG_OFS        (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG0_ICLR_STXFIFOTRG_MASK       ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG0_ICLR_STXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG0_ICLR_STXFIFOTRG_CLR        ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* I2C_DMA_TRIG1_IIDX Bits */
/* I2C_DMA_TRIG1_IIDX[STAT] Bits */
#define I2C_DMA_TRIG1_IIDX_STAT_OFS              (0)                             /* !< STAT Offset */
#define I2C_DMA_TRIG1_IIDX_STAT_MASK             ((uint32_t)0x000000FFU)         /* !< I2C Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. 15h-1Fh =
                                                                                    Reserved */
#define I2C_DMA_TRIG1_IIDX_STAT_NO_INTR          ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define I2C_DMA_TRIG1_IIDX_STAT_MRXFIFOTRG       ((uint32_t)0x00000001U)         /* !< Controller receive FIFO Trigger
                                                                                    Level */
#define I2C_DMA_TRIG1_IIDX_STAT_MTXFIFOTRG       ((uint32_t)0x00000002U)         /* !< Controller transmit FIFO Trigger
                                                                                    level */
#define I2C_DMA_TRIG1_IIDX_STAT_SRXFIFOTRG       ((uint32_t)0x00000003U)         /* !< Target receive FIFO Trigger Level */
#define I2C_DMA_TRIG1_IIDX_STAT_STXFIFOTRG       ((uint32_t)0x00000004U)         /* !< Target transmit FIFO Trigger level */

/* I2C_DMA_TRIG1_IMASK Bits */
/* I2C_DMA_TRIG1_IMASK[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_IMASK_MRXFIFOTRG_OFS       (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_IMASK_MRXFIFOTRG_MASK      ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG1_IMASK_MRXFIFOTRG_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_IMASK_MRXFIFOTRG_SET       ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_IMASK[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_IMASK_MTXFIFOTRG_OFS       (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG1_IMASK_MTXFIFOTRG_MASK      ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG1_IMASK_MTXFIFOTRG_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_IMASK_MTXFIFOTRG_SET       ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_IMASK[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_IMASK_SRXFIFOTRG_OFS       (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_IMASK_SRXFIFOTRG_MASK      ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG1_IMASK_SRXFIFOTRG_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_IMASK_SRXFIFOTRG_SET       ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_IMASK[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_IMASK_STXFIFOTRG_OFS       (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG1_IMASK_STXFIFOTRG_MASK      ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG1_IMASK_STXFIFOTRG_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_IMASK_STXFIFOTRG_SET       ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* I2C_DMA_TRIG1_RIS Bits */
/* I2C_DMA_TRIG1_RIS[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_RIS_MRXFIFOTRG_OFS         (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_RIS_MRXFIFOTRG_MASK        ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG1_RIS_MRXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_RIS_MRXFIFOTRG_SET         ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_RIS[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_RIS_MTXFIFOTRG_OFS         (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG1_RIS_MTXFIFOTRG_MASK        ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG1_RIS_MTXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_RIS_MTXFIFOTRG_SET         ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_RIS[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_RIS_SRXFIFOTRG_OFS         (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_RIS_SRXFIFOTRG_MASK        ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG1_RIS_SRXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_RIS_SRXFIFOTRG_SET         ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_RIS[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_RIS_STXFIFOTRG_OFS         (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG1_RIS_STXFIFOTRG_MASK        ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG1_RIS_STXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_RIS_STXFIFOTRG_SET         ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* I2C_DMA_TRIG1_MIS Bits */
/* I2C_DMA_TRIG1_MIS[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_MIS_MRXFIFOTRG_OFS         (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_MIS_MRXFIFOTRG_MASK        ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG1_MIS_MRXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_MIS_MRXFIFOTRG_SET         ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_MIS[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_MIS_MTXFIFOTRG_OFS         (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG1_MIS_MTXFIFOTRG_MASK        ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG1_MIS_MTXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_MIS_MTXFIFOTRG_SET         ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_MIS[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_MIS_SRXFIFOTRG_OFS         (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_MIS_SRXFIFOTRG_MASK        ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG1_MIS_SRXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_MIS_SRXFIFOTRG_SET         ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_MIS[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_MIS_STXFIFOTRG_OFS         (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG1_MIS_STXFIFOTRG_MASK        ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG1_MIS_STXFIFOTRG_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_MIS_STXFIFOTRG_SET         ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* I2C_DMA_TRIG1_ISET Bits */
/* I2C_DMA_TRIG1_ISET[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_ISET_MRXFIFOTRG_OFS        (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_ISET_MRXFIFOTRG_MASK       ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG1_ISET_MRXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_ISET_MRXFIFOTRG_SET        ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_ISET[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_ISET_MTXFIFOTRG_OFS        (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG1_ISET_MTXFIFOTRG_MASK       ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG1_ISET_MTXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_ISET_MTXFIFOTRG_SET        ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_ISET[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_ISET_SRXFIFOTRG_OFS        (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_ISET_SRXFIFOTRG_MASK       ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG1_ISET_SRXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_ISET_SRXFIFOTRG_SET        ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_ISET[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_ISET_STXFIFOTRG_OFS        (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG1_ISET_STXFIFOTRG_MASK       ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG1_ISET_STXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_ISET_STXFIFOTRG_SET        ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* I2C_DMA_TRIG1_ICLR Bits */
/* I2C_DMA_TRIG1_ICLR[MRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_ICLR_MRXFIFOTRG_OFS        (0)                             /* !< MRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_ICLR_MRXFIFOTRG_MASK       ((uint32_t)0x00000001U)         /* !< Controller Receive FIFO Trigger
                                                                                    Trigger when RX FIFO contains >=
                                                                                    defined bytes */
#define I2C_DMA_TRIG1_ICLR_MRXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_ICLR_MRXFIFOTRG_CLR        ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_ICLR[MTXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_ICLR_MTXFIFOTRG_OFS        (1)                             /* !< MTXFIFOTRG Offset */
#define I2C_DMA_TRIG1_ICLR_MTXFIFOTRG_MASK       ((uint32_t)0x00000002U)         /* !< Controller Transmit FIFO Trigger
                                                                                    Trigger when Transmit FIFO contains
                                                                                    <= defined bytes */
#define I2C_DMA_TRIG1_ICLR_MTXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_ICLR_MTXFIFOTRG_CLR        ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_ICLR[SRXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_ICLR_SRXFIFOTRG_OFS        (2)                             /* !< SRXFIFOTRG Offset */
#define I2C_DMA_TRIG1_ICLR_SRXFIFOTRG_MASK       ((uint32_t)0x00000004U)         /* !< Target Receive FIFO Trigger */
#define I2C_DMA_TRIG1_ICLR_SRXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_ICLR_SRXFIFOTRG_CLR        ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2C_DMA_TRIG1_ICLR[STXFIFOTRG] Bits */
#define I2C_DMA_TRIG1_ICLR_STXFIFOTRG_OFS        (3)                             /* !< STXFIFOTRG Offset */
#define I2C_DMA_TRIG1_ICLR_STXFIFOTRG_MASK       ((uint32_t)0x00000008U)         /* !< Target Transmit FIFO Trigger */
#define I2C_DMA_TRIG1_ICLR_STXFIFOTRG_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2C_DMA_TRIG1_ICLR_STXFIFOTRG_CLR        ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* I2C_CPU_INT_IIDX Bits */
/* I2C_CPU_INT_IIDX[STAT] Bits */
#define I2C_CPU_INT_IIDX_STAT_OFS                (0)                             /* !< STAT Offset */
#define I2C_CPU_INT_IIDX_STAT_MASK               ((uint32_t)0x000000FFU)         /* !< I2C Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. 15h-1Fh =
                                                                                    Reserved */
#define I2C_CPU_INT_IIDX_STAT_NO_INTR            ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define I2C_CPU_INT_IIDX_STAT_MRXDONEFG          ((uint32_t)0x00000001U)         /* !< Controller data received */
#define I2C_CPU_INT_IIDX_STAT_MTXDONEFG          ((uint32_t)0x00000002U)         /* !< Controller data transmitted */
#define I2C_CPU_INT_IIDX_STAT_MRXFIFOTRG         ((uint32_t)0x00000003U)         /* !< Controller receive FIFO Trigger
                                                                                    Level */
#define I2C_CPU_INT_IIDX_STAT_MTXFIFOTRG         ((uint32_t)0x00000004U)         /* !< Controller transmit FIFO Trigger
                                                                                    level */
#define I2C_CPU_INT_IIDX_STAT_MRXFIFOFULL        ((uint32_t)0x00000005U)         /* !< RX FIFO FULL Event/interrupt
                                                                                    pending */
#define I2C_CPU_INT_IIDX_STAT_MTX_EMPTY          ((uint32_t)0x00000006U)         /* !< Transmit FIFO/Buffer Empty
                                                                                    Event/interrupt pending */
#define I2C_CPU_INT_IIDX_STAT_MNACKFG            ((uint32_t)0x00000008U)         /* !< Address/Data NACK */
#define I2C_CPU_INT_IIDX_STAT_MSTARTFG           ((uint32_t)0x00000009U)         /* !< Start Event */
#define I2C_CPU_INT_IIDX_STAT_MSTOPFG            ((uint32_t)0x0000000AU)         /* !< Stop Event */
#define I2C_CPU_INT_IIDX_STAT_MARBLOSTFG         ((uint32_t)0x0000000BU)         /* !< Arbitration Lost */
#define I2C_CPU_INT_IIDX_STAT_MDMA_DONE_TX       ((uint32_t)0x0000000CU)         /* !< DMA DONE on Channel TX */
#define I2C_CPU_INT_IIDX_STAT_MDMA_DONE_RX       ((uint32_t)0x0000000DU)         /* !< DMA DONE on Channel RX */
#define I2C_CPU_INT_IIDX_STAT_MPEC_RX_ERR        ((uint32_t)0x0000000EU)         /* !< Controller PEC Receive Error Event */
#define I2C_CPU_INT_IIDX_STAT_TIMEOUTA           ((uint32_t)0x0000000FU)         /* !< Timeout A Event */
#define I2C_CPU_INT_IIDX_STAT_TIMEOUTB           ((uint32_t)0x00000010U)         /* !< Timeout B Event */
#define I2C_CPU_INT_IIDX_STAT_SRXDONEFG          ((uint32_t)0x00000011U)         /* !< Target Data Event */
#define I2C_CPU_INT_IIDX_STAT_STXDONEFG          ((uint32_t)0x00000012U)         /* !< Target Data Event */
#define I2C_CPU_INT_IIDX_STAT_SRXFIFOTRG         ((uint32_t)0x00000013U)         /* !< Target receive FIFO Trigger Level */
#define I2C_CPU_INT_IIDX_STAT_STXFIFOTRG         ((uint32_t)0x00000014U)         /* !< Target transmit FIFO Trigger level */
#define I2C_CPU_INT_IIDX_STAT_SRXFIFOFULL        ((uint32_t)0x00000015U)         /* !< RX FIFO FULL Event/interrupt
                                                                                    pending */
#define I2C_CPU_INT_IIDX_STAT_STXEMPTY           ((uint32_t)0x00000016U)         /* !< Transmit FIFO/Buffer Empty
                                                                                    Event/interrupt pending */
#define I2C_CPU_INT_IIDX_STAT_SSTARTFG           ((uint32_t)0x00000017U)         /* !< Start Event */
#define I2C_CPU_INT_IIDX_STAT_SSTOPFG            ((uint32_t)0x00000018U)         /* !< Stop Event */
#define I2C_CPU_INT_IIDX_STAT_SGENCALL           ((uint32_t)0x00000019U)         /* !< General Call Event */
#define I2C_CPU_INT_IIDX_STAT_SDMA_DONE_TX       ((uint32_t)0x0000001AU)         /* !< DMA DONE on Channel TX */
#define I2C_CPU_INT_IIDX_STAT_SDMA_DONE_RX       ((uint32_t)0x0000001BU)         /* !< DMA DONE on Channel RX */
#define I2C_CPU_INT_IIDX_STAT_SPEC_RX_ERR        ((uint32_t)0x0000001CU)         /* !< Target PEC receive error event */
#define I2C_CPU_INT_IIDX_STAT_STX_UNFL           ((uint32_t)0x0000001DU)         /* !< Target TX FIFO underflow */
#define I2C_CPU_INT_IIDX_STAT_SRX_OVFL           ((uint32_t)0x0000001EU)         /* !< Target RX FIFO overflow event */
#define I2C_CPU_INT_IIDX_STAT_SARBLOST           ((uint32_t)0x0000001FU)         /* !< Target arbitration lost event */
#define I2C_CPU_INT_IIDX_STAT_INTR_OVFL          ((uint32_t)0x00000020U)         /* !< Interrupt overflow event */

